Тест1/src/DocumentJournals/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>Продажи</name>
  <registeredDocuments>Document.ПродажаЗапчастей</registeredDocuments>
  <registeredDocuments>Document.ЗаказНаряд</registeredDocuments>
  <columns>
    <name>Клиент</name>
  </columns>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Сумма</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
  <columns>
    <name>Состояние</name>
  </columns>
</mdclass:DocumentJournal>

Тест1/src/Enums/СостоянияЗаказНаряда/СостоянияЗаказНаряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказНаряда</name>
  <enumValues>
    <name>Предварительный</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>НеПриехал</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/DocumentJournals/Продажи/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ Параметры.Свойство("РежимВРаботе", РежимВРаботе) Тогда
		РежимВРаботе = Истина;
	КонецЕсли;	
	
	ЭтаФорма.АвтоЗаголовок = НЕ РежимВРаботе; 
	Если РежимВРаботе Тогда
		Заголовок = "Продажи в работе";
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	ОбновитьСписок();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписок()

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Ответственный", Ответственный, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Закрыто", 
		Истина, // Значение отбора
		ВидСравненияКомпоновкиДанных.НеРавно,
		,
		РежимВРаботе
	);

	
КонецПроцедуры // УстановитьОтбор()

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Состояние
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();
	
	// ЗН.В работе, Продажа.Собран  -Зеленый
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы, "ИЛИ", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Состояние", ВидСравненияКомпоновкиДанных.Равно, ПредопределенноеЗначение("Перечисление.СостоянияЗаказНаряда.ВРаботе"));
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Состояние", ВидСравненияКомпоновкиДанных.Равно, ПредопределенноеЗначение("Перечисление.СтатусОтправки.Собран"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	
	// Продажа.Сборка - Желтый
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Состояние", ВидСравненияКомпоновкиДанных.Равно, ПредопределенноеЗначение("Перечисление.СтатусОтправки.Сборка"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
	
	// Сумма оплаты не совпадает с суммой документа - оранжевый
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();
	ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор.Элементы, "И", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
		"СуммаОплачено", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
		"СуммаОплачено", ВидСравненияКомпоновкиДанных.НеРавно, Новый ПолеКомпоновкиДанных("Сумма"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Оранжевый);
		
КонецПроцедуры




#КонецОбласти
